数据重构

In [1]:
import numpy as np
import pandas as pd

 1.数据的合并

In [6]:
#这里的四张表是将原来的train数据分别按行和列分离成的四份
pflu = pd.read_csv("data/train-left-up.csv")
pfld = pd.read_csv("data/train-left-down.csv")
pfru = pd.read_csv("data/train-right-up.csv")
pfrd = pd.read_csv("data/train-right-down.csv")

pandas的连接函数concat()函数：
concat函数是在pandas底下的方法，可以将数据根据不同的轴作简单的融合，用作合并和多组数据合并。 series，dataframe或者是panel构成的序列lsit都是可操作的对象。

pd.concat( [df数据1， df数据2， …… ], axis = 0或1， join = 连接方式， keys = 表明数据来源 )

相关参数含义：

axis： 需要合并链接的轴，0是行，1是列

join：连接的方式 ，默认是inner

In [17]:
#用concat（）合并：
result_up1 = pd.concat([pflu, pfru], axis = 1)
result_up1.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [19]:
result_down1 = pd.concat([pfld, pfrd], axis = 1)
result1 = pd.concat([result_up1, result_down1], axis = 0)
result1.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
447,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
448,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
449,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
450,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
451,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

DataFrame.join(other, on=None, how='left', sort=False)

how参数的使用（下面的merge相同）：{'left'， 'right'， 'outer'， 'inner'}

left：使用调用帧的索引（如果指定了 on，则使用列）

right：使用他人的索引。

outer：将调用帧的索引（或指定了 on 的列）与 other 的索引合并，然后对其进行排序。词典编纂。

inner：形成调用帧的索引（或指定了 on 的列）与其他索引的交集，保留调用的索引的顺序。

cross：从两个帧创建笛卡尔积，保留左键的顺序。

In [32]:
#使用DataFrame自带的方法join方法和append进行合并：
result_up2 = pflu.join(pfru)
result_down2 = pfld.join(pfrd)
#result = result_up2.append(result_down2)
result2 = pd.concat([result_up2,result_down2])
result2.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
447,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
448,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
449,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
450,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
451,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

注：append方法目前还能使用，但在新版pandas中，即将被concat方法替代，所以尽量使用功能更加强大的concat方法

DataFrame.merge(Object, how='inner', on=None, left_on=None, right_on=None, left_index=False, right_index=False, sort=False, suffixes=('_x', '_y'), copy=True, indicator=False, validate=None）

Object是右表，用于和DataFrame进行合并(这个方法用于合并表，想添加样本还需要用append或者concat方法)

how表示

left_on标签或列表，或类似数组，要在左侧数据帧中联接的列或索引级别名称。也可以是左侧数据帧长度的数组或数组列表。这些数组被视为列。

left_index布尔，默认为假。使用左侧数据帧中的索引作为连接键。如果是 MultiIndex，则其他 DataFrame 中的键数（索引或列数）必须与级别数匹配。

In [27]:
#使用Panads的merge方法进行合并：
result_up3 = pflu.merge(pfru, left_index=True,right_index=True)
result_up3.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
434,435,0,1,"Silvey, Mr. William Baird",male,50.0,1,0,13507,55.900,E44,S
435,436,1,1,"Carter, Miss. Lucile Polk",female,14.0,1,2,113760,120.000,B96 B98,S
436,437,0,3,"Ford, Miss. Doolina Margaret ""Daisy""",female,21.0,2,2,W./C. 6608,34.375,NaN,S
437,438,1,2,"Richards, Mrs. Sidney (Emily Hocking)",female,24.0,2,3,29106,18.750,NaN,S
438,439,0,1,"Fortune, Mr. Mark",male,64.0,1,4,19950,263.000,C23 C25 C27,S

In [34]:
result_down3 = pfld.merge(pfrd, left_index=True,right_index=True)
result3 = pd.concat([result_up3,result_down3])
result3.tail()
result3.to_csv('result.csv')

2.数据类型的转换

In [42]:
#将dataframe类型的数据变为Series类型的数据，实际上是一种降维操作
text = pd.read_csv('result.csv')
unit_result=text.stack()
unit_result.head(25)

0  Unnamed: 0                                                     0
   PassengerId                                                    1
   Survived                                                       0
   Pclass                                                         3
   Name                                     Braund, Mr. Owen Harris
   Sex                                                         male
   Age                                                         22.0
   SibSp                                                          1
   Parch                                                          0
   Ticket                                                 A/5 21171
   Fare                                                        7.25
   Embarked                                                       S
1  Unnamed: 0                                                     1
   PassengerId                                                    2
   Survived                                                       1
   Pclass                                                         1
   Name           Cumings, Mrs. John Bradley (Florence Briggs Th...
   Sex                                                       female
   Age                                                         38.0
   SibSp                                                          1
   Parch                                                          0
   Ticket                                                  PC 17599
   Fare                                                     71.2833
   Cabin                                                        C85
   Embarked                                                       C
dtype: object

DataFrame.stack(level=- 1, dropna=True)作用是将规定的级别从列堆叠到索引。

返回与当前 DataFrame 相比具有多级索引的已重新调整的 DataFrame 或 Series，该索引具有一个或多个新的最内层。新的最内层是通过透视当前 DataFrame的列来创建的：

3.数据聚合与运算

In [134]:
pf = pd.read_csv("train.csv")
pf.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Groupby机制：Hadley Wickham（许多热门R语言包的作者）创造了一个用于表示分组运算的术语"split-apply-combine"（拆分－应用－合并）。第一个阶段，pandas对象（无论是Series、DataFrame还是其他的）中的数据会根据你所提供的一个或多个键被拆分（split）为多组。拆分操作是在对象的特定轴上执行的。例如，DataFrame可以在其行（axis=0）或列（axis=1）上进行分组。然后，将一个函数应用（apply）到各个分组并产生一个新值。最后，所有这些函数的执行结果会被合并（combine）到最终的结果对象中。结果对象的形式一般取决于数据上所执行的操作。

In [49]:
#计算泰坦尼克号男性与女性的平均票价,下面两种写法都能得到结果
pf.groupby(['Sex'])[[ 'Fare']].mean()

             Fare
Sex
female  44.479818
male    25.523893

In [101]:
#通过对比可以看出，groupby要求传入明确的类作为对象，下面的由于在pf中先使用了Fare，所以groupby需要指明Sex数据在哪
FS = pf.Fare.groupby(pf['Sex']).mean()

In [102]:
#统计泰坦尼克号中男女的存活人数
SS = pf.Survived.groupby(pf['Sex']).sum()

In [78]:
pf.Survived.groupby(pf['Pclass']).sum()

Pclass
1    136
2     87
3    119
Name: Survived, dtype: int64

DataFrame.groupby(by=None, axis=0, level=None, as_index=True, sort=True, group_keys=True, squeeze=NoDefault.no_default, observed=False, dropna=True)

level：int，level name, or sequence of such, default None

如果轴是多索引（分层），则按特定级别分组。

dropna：bool类型参数，默认为True

如果 True，并且组键包含 NA 值，则将删除 NA 值以及行/列。如果为 False，则 NA 值也将被视为组中的键。

In [89]:
#用agg（）方法自定义组合
pf.groupby('Sex').agg({'Fare': 'mean', 'Pclass': 'count'}).rename(columns={'Fare': 'mean_fare', 'Pclass': 'count_pclass'})

        mean_fare  count_pclass
Sex
female  44.479818           314
male    25.523893           577

DataFrame.agg(func=None, axis=0, *args, **kwargs)

对于agg（）方法，最重要的是传入的参数func，可接受的组合包括：

（1）函数

（2）字符串函数名称

（3）函数和/或函数名称列表，例如[np.sum, 'mean']

（4）轴标签的字典 - >函数，函数名称或此类列表。

In [94]:
#统计在不同等级的票中的不同年龄的船票花费的平均值
pf.groupby(['Pclass','Age'])[['Fare']].mean().head()

                  Fare
Pclass Age
1      0.92   151.5500
       2.00   151.5500
       4.00    81.8583
       11.00  120.0000
       14.00  120.0000

In [93]:
pf.groupby(['Pclass','Age'])[['Fare']].mean().tail()

               Fare
Pclass Age
3      61.0  6.2375
       63.0  9.5875
       65.0  7.7500
       70.5  7.7500
       74.0  7.7750

In [103]:
sex_fare_survived = pd.concat([FS, SS], axis = 1)
#sex_fare_survived = pd.merge(FS, SS, on='Sex')
sex_fare_survived.head()

             Fare  Survived
Sex
female  44.479818       233
male    25.523893       109

In [104]:
sex_fare_survived.to_csv("sex_fare_survived.csv")

In [142]:
#得出不同年龄的总的存活人数，然后找出存活人数最多的年龄段，最后计算存活人数最高的存活率（存活人数/总人数）
SA = pf[['Survived']].groupby(pf['Age']).sum()

In [135]:
#添加一列，用于统计各年龄段总人数
pf.insert(loc=2, column='Number', value=1)

In [143]:
NA = pf[['Number']].groupby(pf['Age']).sum()

In [165]:
survival_rate = pd.concat([SA, NA], axis = 1)
survival_rate.head(20)

       Survived  Number
Age
0.42          1       1
0.67          1       1
0.75          2       2
0.83          2       2
0.92          1       1
1.00          5       7
2.00          3      10
3.00          5       6
4.00          7      10
5.00          4       4
6.00          2       3
7.00          1       3
8.00          2       4
9.00          2       8
10.00         0       2
11.00         1       4
12.00         1       1
13.00         2       2
14.00         3       6
14.50         0       1

In [166]:
survival_rate.insert(loc=2,column='Survival_Rate',value=0)

In [167]:
#统计各年龄段的存活率
survival_rate['Survival_Rate'] = survival_rate.apply(lambda x: x['Survived'] / x['Number'], axis=1)
survival_rate.head(10)

      Survived  Number  Survival_Rate
Age
0.42         1       1       1.000000
0.67         1       1       1.000000
0.75         2       2       1.000000
0.83         2       2       1.000000
0.92         1       1       1.000000
1.00         5       7       0.714286
2.00         3      10       0.300000
3.00         5       6       0.833333
4.00         7      10       0.700000
5.00         4       4       1.000000

In [174]:
#存活人数最多的年龄段
survival_rate[survival_rate['Survived'].values == survival_rate['Survived'].max()]

      Survived  Number  Survival_Rate
Age
24.0        15      30            0.5

In [178]:
#最大存活率
survival_rate_max1 =survival_rate.Survived.max() / survival_rate.Survived.sum()
survival_rate_max1

0.05172413793103448

In [179]:
survival_rate_max2 =survival_rate.Survived.max() / pf.Survived.sum()
survival_rate_max2

0.043859649122807015

为什么两次计算结果不一样呢？因为groupby在进行分组生成新表survival_rate时，参数dropna设置为默认值True，自动去除了原数据中没有年龄标注的样本，造成了样本缺失，导致了最终的统计偏差。

但是反过来思考一下，因为我们无法获知没有年龄标注的样本都处于什么年龄层次，所以忽略这些样本反而可能是最好的选择，所以在统计和年龄相关的最大存活率时，应采用survival_rate的样本数，从分子和分母上都去除有缺失值的样本，而不是将其直接加在分母上。